org/posts/2024-07-31-use-tldraw-in-vite.org
#+TITLE: Use tldraw in Vite
#+AUTHOR: Chuck
#+DATE: <2024-07-31 Wed 11:28>

[[https://vitejs.dev/][Vite]] is a build tool that aims to provide a faster and leaner development experience for modern web projects.

Is consists of two major parts:
- A dev server that provides rich feature enhancements over native ES modules, for example extremly fast Hot Module Replacement(HMR).
- A build command that bundles your code with Rollup, pre-configured to output highly optimized static assets for production.

[[https://tldraw.com/][tldraw]] is a library for creating infinite canvas experiences in [[https://react.dev/][React]].

To scaffold a Vite+React project, run:

#+begin_src shell
npm create vite@latest tldraw -- --template react-swc-ts
cd tldraw
npm install
npm run dev
#+end_src

Install tldraw library, run:

#+begin_src shell
npm install tldraw
#+end_src

Import fonts and CSS for tldraw, edit =App.css=:

#+begin_src css
@import url("https://fonts.googleapis.com/css2?family=Inter:wght@500;700&display=swap");
@import url("tldraw/tldraw.css");

body {
  font-family: "Inter";
}
#+end_src

Render the tldraw component, edit =App.tsx=:

#+begin_src tsx
import { Tldraw } from 'tldraw'
import './App.css'

function App() {
    return (
        <div style={{ position: 'fixed', inset: 0 }}>
            <Tldraw />
        </div>
    )
}

export default App
#+end_src

You may run =npm run build= to build the app, and run =npm run preview= to test it.

